// 1. Создайте функцию, которая принимает два числа и возвращает их сумму.
// 2. Создайте функцию, которая принимает строку и число, и возвращает строку с указанным числом раз повторенную.
// 3. Создайте функцию, которая принимает число и возвращает другую функцию, которая возвращает данное число умноженное на любое переданное число.
// 4. Создайте функцию, которая принимает объект с двумя свойствами - "имя" и "возраст" - и возвращает функцию, которая выводит на экран "Привет, [имя]! Вам [возраст] лет."
// 5. Создайте функцию, которая принимает число и возвращает функцию, которая при вызове добавляет заданное число к переданному значению.
// 6. Создайте функцию, которая принимает строку и возвращает функцию, которая принимает число и возвращает эту строку, повторенную заданное число раз.
// 7. Создайте функцию, которая принимает массив и возвращает функцию, которая принимает число и возвращает новый массив, содержащий элементы исходного массива, умноженные на заданное число.
// 8. Создайте функцию, которая принимает строку и число, и возвращает функцию, которая добавляет заданное число пробелов перед строкой.
// 9. Создайте функцию, которая принимает число и возвращает функцию, которая при вызове умножает переданное значение на заданное число.
// 10. Создайте функцию, которая принимает массив и число, и возвращает новый массив, содержащий элементы исходного массива, умноженные на указанное число.